from typing import Sequence, Union

from alembic import op
import sqlalchemy as sa

revision: str = 'b10d9c1e191c'
down_revision: Union[str, Sequence[str], None] = '20260207_create_bot_tables'
branch_labels: Union[str, Sequence[str], None] = None
depends_on: Union[str, Sequence[str], None] = None


def upgrade() -> None:
    messages_table = sa.table(
        "messages_texts",
        sa.column("message_key", sa.String),
        sa.column("text", sa.Text),
    )

    op.bulk_insert(
        messages_table,
        [
            {
                "message_key": "welcome_message",
                "text": """Здравствуйте!👋
Рады видеть вас в официальном боте COSMOKEY бренда
профессиональной продукции от выпадения и для роста волос.


Здесь вы можете:

• получить ваш электронный подарок🎁
• обратиться в поддержку💬
• получить вознаграждение за отзыв💸
• узнать полезную информацию о продукции


Выберите действие ниже.""",
            },
            {
                "message_key": "reward_received",
                "text": """Готово!🎉
Ваш подарок уже
здесь —
приятного
пользования⭐""",
            },
            {
                "message_key": "subscription_check",
                "text": """Спасибо, что выбрали продукцию COSMOKEY💙 Ваш подарок уже готов к отправке. Чтобы получить доступ, подпишитесь на наш Telegram-канал.""",
            },
            {
                "message_key": "subscription_check_failed",
                "text": """Кажется, вы не подписаны.
Пожалуйста, подпишитесь, чтобы
получить подарок """,
            },
            {
                "message_key": "assistance_request_received",
                "text": """Пожалуйста, опишите проблему и укажите номер заказа (если есть).
Прикрепите фото или видео повреждения — это поможет решить вопрос быстрее """,
            },
            {
                "message_key": "complaint_received",
                "text": """Опишите вашу претензию максимально подробно и укажите номер заказа.
Мы разберёмся и вернёмся с ответом.""",
            },
            {
                "message_key": "feedback_request",
                "text": """Нам действительно важно ваше мнение 
                Напишите, пожалуйста, отзыв о продукте или опыте покупки.""",
            },
            {
                "message_key": "feedback_received",
                "text": """Спасибо! Ваше обращение принято и передано в работу менеджеру. Мы свяжемся с вами в течение 5 дней""",
            },
            {
                "message_key": "reward_request",
                "text": """Хотите получить вознаграждение за отзыв?
Нам нужны фото результаты
использования продукта (+
желательно до/после ) и ссылка
на ваш отзыв на Wildberries или
Ozon.

Готовы отправить материалы?""",
            },
            {
                "message_key": "get_photo_for_reward",
                "text": """Прикрепите фото результаты (до/после).""",
            },
            {
                "message_key": "get_link_for_reward",
                "text": """ Отправьте ссылку на ваш опубликованный
отзыв.""",
            },
            {
                "message_key": "reward_submission_received",
                "text": """Cпасибо! Ваши материалы отправлены модератору.

Проверка обычно занимает до 5 дней.

После подтверждения мы свяжемся с вами в
личных сообщениях для отправки
вознаграждения.""",
            },
            {
                "message_key": "feedback_welcome_message",
                "text": """Как мы можем помочь?
                Выберите категорию:
                    """
            }
        ],
    )


def downgrade() -> None:
    op.execute(
        """
        DELETE
        FROM messages_texts
        WHERE message_key IN (
                              'reward_submission_received',
                              'get_link_for_reward',
                              'get_photo_for_reward',
                              'reward_request',
                              'feedback_received',
                              'feedback_request',
                              'complaint_received',
                              'assistance_request_received',
                              'subscription_check_failed',
                              'subscription_check',
                              'reward_received',
                              'welcome_message',
                              'feedback_welcome_message'
            )
        """
    )
